# Week 1 of learning ML concepts and basics

### - [ ] Read: [Kaggle Python Intro](https://www.kaggle.com/learn/python)
### - [ ] Practice lists, dictionaries, loops, functions.
### - [ ] Write a function to calculate mean, median, std deviation for a list.

In [1]:
def isOldenough(age):
    """Is someone old enough"""
    return True if age >15 else False

print(isOldenough(12))

False

In [2]:
#working with lists
primes=[5,7,9,11]
primes.reverse()
print(primes)

[11, 9, 7, 5]

In [4]:
primes.append(17)
print(primes)

[11, 9, 7, 5, 17, 17]

In [5]:
primes.remove(17)

In [6]:
print(primes)

[11, 9, 7, 5, 17]

In [9]:
primes.sort()
print(primes)

[5, 7, 9, 11, 17]

In [17]:
print(7 in primes)

True

In [21]:
for nums in primes:
    print(nums) if nums> 7 else print("too small")

too small
too small
9
11
17

In [22]:
for i in range(50):
    const=i+2
    i=i*const
    print(i)

0
3
8
15
24
35
48
63
80
99
120
143
168
195
224
255
288
323
360
399
440
483
528
575
624
675
728
783
840
899
960
1023
1088
1155
1224
1295
1368
1443
1520
1599
1680
1763
1848
1935
2024
2115
2208
2303
2400
2499

In [24]:
def mean(numbers):
    """calculate the mean of the lis"""
    if not numbers:
        return 0
    return sum(numbers)/len(numbers)

numbers=[1,2,3,4,5,6,7,8,9,10,15,25,43]
print(mean(numbers))

10.615384615384615

In [31]:
def median(numbers):
    """Calculate the median of a list of numbers."""
    if not numbers:
        return 0
    
    # Sort the numbers first
    sorted_numbers = sorted(numbers)
    n = len(sorted_numbers)
    
    # If odd number of elements, return middle element
    if n % 2 == 1:
        return sorted_numbers[n // 2]
    # If even number of elements, return average of two middle elements
    else:
        mid1 = sorted_numbers[n // 2 - 1]
        mid2 = sorted_numbers[n // 2]
        return (mid1 + mid2) / 2
    
median(numbers)

7

In [ ]:
def std(numbers):
    if not numbers:
        return 0
    std=0
    mean_value=mean(numbers)
    for nums in numbers:
        if nums!=mean_value: 
            std+=(mean_value-nums)**2

    return std

std(numbers)

1619.0769230769233

In [39]:
import numpy as np

array=np.array([[1,2,3],[4,5,6]])
print(array)
array.sort()
print(array.shape)

[[1 2 3]
 [4 5 6]]
(2, 3)

In [40]:
import pandas as pd

data=pd.read_csv('train.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [45]:
data.Survived

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [47]:
data.set_index('PassengerId')

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [48]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [50]:
data.Pclass.describe()

count    891.000000
mean       2.308642
std        0.836071
min        1.000000
25%        2.000000
50%        3.000000
75%        3.000000
max        3.000000
Name: Pclass, dtype: float64

In [51]:
data.Pclass.unique()

array([3, 1, 2], dtype=int64)

In [56]:
data.Pclass.value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [62]:
data.groupby('Pclass').count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [63]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [66]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [67]:
data.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [71]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64